# Pandas

1. Pandas is an open source library built on top of Numpy
2. It allows for fast analysis and data cleaning and preparation
3. It is also called as the Excel or R version of Python
4. It excels in performance and productivity
5. It also has built-in visualization features
6. It can work with data form a wide variety of resources
7. conda or pip install pandas (by going to cmd)

Series: It is very similar to a numpy array, infact it is built on top of a numpy object. But what differentiates a numpy array from pandas series is that the series cannot access labels. Meaning, it can be indexed by a label.

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels=['a','b','c']       #4 separate python  objects
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

Now we will take a look at series and how it actually looks like

In [4]:
pd.Series(data=my_data)    #shift+tab and we will see that there are many parameters in Series. But data and index are most important and m=used ones

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=my_data, index=labels)    #now we have a labelled index series

a    10
b    20
c    30
dtype: int64

So unlike a numpy array we actually have index that are labelled(a,b,c), meaning we can call the data points(10,20,30) using these labelled index

In [7]:
pd.Series(my_data,labels)   #put data and index in correct order

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr)   #we passed a numpy array

0    10
1    20
2    30
dtype: int32

In [11]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [13]:
pd.Series(d)   #automatically takes the key of the dictionary set it as an index and then set the value of the key to the corresponding data point

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [16]:
pd.Series(data=labels)   #so the advantage of series is that it is able to handle almost any type of data object with python as its data point

0    a
1    b
2    c
dtype: object

In [18]:
pd.Series(data=[sum,print,len])   #built in functons passed. (The above and this cell are the things that we cannot do with numpy arrays)

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

Now we can take a look at how we can grab information from the series

In [19]:
ser1=pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [20]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [21]:
ser2=pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [22]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

Now if we want to grab information from the python series it is similar ot grabbing information from the python dictionary

In [23]:
ser1['USA']

1

In [24]:
ser3=pd.Series(data=labels)

In [25]:
ser3

0    a
1    b
2    c
dtype: object

In [26]:
ser3[1]

'b'

In [27]:
ser1+ser2    #where it could not find a match in both the series it will put the null value (Series Operations.)

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

The above cell shows that Pandas in NUmpy will always convert stuff to float in order to retain all the information possible

# DataFrames

Dataframes are going to be the main tool when working with pandas.

In [12]:
import numpy as np
import pandas as pd

In [13]:
from numpy.random import randn

In [14]:
np.random.seed(101)   #we set the seed, and seed means is just to make sure that we get the same random numbersdf=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [15]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])   #1st argument is data, then rows and columns

In [16]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df['W']     #returns W column --> looks like series that we studied above

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [20]:
type(df['W'])    #confirms that it's type is panda series

pandas.core.series.Series

In [22]:
type(df)    #so dataframe is just a bench of series that share the same index

pandas.core.frame.DataFrame

In [25]:
df.W   #can also be used to get column but the above method is more recommended(Brack Notation)

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [27]:
df[['W','Z']]    #getting multiple coumns we actually get a dataframe instead of the series

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [28]:
df['new']=df['W']+df['Y']    #to add the new column

In [29]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [30]:
df.drop('new',axis=1)   #bydefault axis=0 in this drop method which represents indexes i.e rows. Set axis=1 for column drop

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df    #the above doesn't happen in place meaning it doesn't change original dataframe unless we specifically specify for above to happen and delete columns

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [35]:
df.drop('new',axis=1,inplace=True)   #set inplace=True to remove the column permanently from original dataframe

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

We can also use df.drop to drop rows as follows

In [40]:
df.drop('E',axis=0)   #dont need axis parameter here since axis=0 by default in drop method (now beinf done inplace)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [41]:
df.shape   #gives the tuple. At 0 index gives rows and at 1 index gives columns. So, axis=0 for rows and axis=1->columns

(5, 4)

In [42]:
#Selectring Rows

In [43]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df.loc['A']    #pass in name of the row and this will return the series  (Use Square Brackets)

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

So from above we can drive the conclusion that not only all the columns series but all the rows are also series

In [46]:
df.iloc[2]   #2nd way to grab a row from dataframe. Use index location inspite of the fact that our rows are labelled by strings

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [47]:
#now we will learn selecting subsets of rows and columns

In [48]:
df.loc['B','Y']

-0.8480769834036315

In [49]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# DataFrames Part2

In [50]:
#now we will take a look at conditional-selection as well as some multi-index parts af a dataframe

In [51]:
import numpy as np
import pandas as pd

In [52]:
from numpy.random import randn

In [53]:
np.random.seed(101)

In [54]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [55]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
#a very important feature of pandas is the ability to perform conditional selection using bracket notation

In [58]:
booldf=df>0   #returns a datframe of boolean values (same to numpy)

In [59]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [60]:
df[booldf]  #that is where we can use conditional selection using dataframes

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [61]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
df['W']>0   #returns a series of specified column

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [67]:
df[df['W']>0]    #will only return rows in which the condition is true. In this case, row C will be removed(Since we are passing series we dont get null values)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
df[df['Z']<0]     #column Z is less than 0 at only row C so we get entire row C

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [71]:
resultdf=df[df['W']>0 ]    #we get a dataframe in response and that we means we can call commands of this resulting dataframe

In [72]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [73]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [74]:
df[df['W']>0]['X']  #the abve 3 sells can be done by this single command. (since it is a dataframe we can stack commands on it)

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [75]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [76]:
boolser=df['W']>0

In [77]:
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [78]:
result=df[boolser]
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [79]:
mycols=['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [81]:
#now we will use the concept of using multiple conditions
#right now we are comfortable in doing the following
df[df['W']>0]   #gives subset of the dataframe

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [84]:
#but what if we wanted multiple conditions
df[(df['W']>0) & (df['Y']>1)]   
#we can't use and function because and cannot take series of boolean values and compare them. AND only takes single boolean value
#for OR operator use pipe | operator

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [85]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [86]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [91]:
df.reset_index()   #we get previous index reset to a column and actual index will be numerical now
#doesn't happen in place unless we specify it to be. For it to be inplace, set inplace=True in it's parameter(shift+tab)

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [90]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [92]:
newind='CA NY WY OR CO'.split()

In [93]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [95]:
df['States']=newind

In [96]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [97]:
df.set_index('States')   #the states column will become the index   (not inplace, set True if we want)

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# Data Frames Part 3

In [1]:
#we will learn about multi index and index hierarchy

In [12]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [13]:
#Index Levels
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [16]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [17]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [14]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [18]:
df   
#this data frame has 2 levels of index that is G1 and G2 level, and the inside level that is 1,2,3 and 2 columns A and B.
#the following is how the data frame looks like when it has multi level of index otheriwse known as index hierarchy

             A         B
G1 1  0.514093 -0.899662
   2  0.124933  0.185701
   3 -1.494610  0.403569
G2 1 -2.092212 -0.675035
   2 -0.841322  0.283074
   3 -0.025487 -0.046998

In [19]:
#now we will learn how we can call data from this multi level index

In [20]:
df.loc['G1']

          A         B
1  0.514093 -0.899662
2  0.124933  0.185701
3 -1.494610  0.403569

In [22]:
df.loc['G1'].loc[1]   #so we will call from outside index and continue calling inside

A    0.514093
B   -0.899662
Name: 1, dtype: float64

In [23]:
df

             A         B
G1 1  0.514093 -0.899662
   2  0.124933  0.185701
   3 -1.494610  0.403569
G2 1 -2.092212 -0.675035
   2 -0.841322  0.283074
   3 -0.025487 -0.046998

In [25]:
df.index.names     #no name assigned to indexes right now

FrozenList([None, None])

In [26]:
df.index.names=['Groups','Num']

In [27]:
df

                   A         B
Groups Num
G1     1    0.514093 -0.899662
       2    0.124933  0.185701
       3   -1.494610  0.403569
G2     1   -2.092212 -0.675035
       2   -0.841322  0.283074
       3   -0.025487 -0.046998

In [29]:
df.loc['G2'].loc[2]      #we want to grab 0.283074

A   -0.841322
B    0.283074
Name: 2, dtype: float64

In [30]:
df.loc['G2'].loc[2]['B']

0.283073638353413

In [31]:
df.loc['G1'].loc[3]['A']

-1.4946099735337637

In [32]:
#now we will learn about a very useful functon called cross section(xs)
#Return cross-section from the Series/DataFrame. And we will use it when we have multi level index
df.xs('G1')

            A         B
Num
1    0.514093 -0.899662
2    0.124933  0.185701
3   -1.494610  0.403569

In [33]:
df.xs(1,level='Num')    
#gives the complete rows of num=1 under groups G1 and G2. This indexing would have been different if we have used loc notation
#but xs does that easily

               A         B
Groups
G1      0.514093 -0.899662
G2     -2.092212 -0.675035

# Missing Data

In [34]:
#we will look at a few convenient method to deal with missing data in pandas.

In [35]:
import numpy as np
import pandas as pd

In [36]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [37]:
df=pd.DataFrame(d)

In [38]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [39]:
#drop rows that have any missing values
df.dropna()   #axis=0 so by default action occurs on rows. change axis=1 to delete columns of missing values

     A    B  C
0  1.0  5.0  1

In [40]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [42]:
#se can also set the threshold on the number of null values to be dropped
df.dropna(thresh=2)   #shift+tab(documentation). drops the row with atleast 2 null values(axis =0)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [43]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [44]:
#we can also fill null values using fillna method
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [45]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [46]:
#usually we fill values with the mean of the column
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [47]:
#in reality there are many methods of filling null values which depends upon the type of data we are working with

# Groupby

Groupby allows us to group together rows based off of a column and perform an aggregate function on them. So, groupby is a fancy term for any function that takes in many values and outputs a single value.

In [48]:
import numpy as np
import pandas as pd

In [49]:
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
      'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
     'Sales':[200,120,340,124,243,350]}

In [51]:
df=pd.DataFrame(data)

In [52]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [53]:
df.groupby('Company')

In [54]:
bycompany=df.groupby('Company')

In [56]:
bycompany.mean()   #gives the mean of sales of each company. Can't be done on person column cuz they are strings

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [57]:
bycompany.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [58]:
bycompany.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [59]:
bycompany.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [60]:
bycompany.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [61]:
df.groupby('Company').sum()   #all above steps in one line

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [62]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [64]:
df.groupby('Company').count()   #counts instance of individual columns per company

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [65]:
df.groupby('Company').max()     #notice the person column it is sorted by alphabetical order

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [66]:
df.groupby('Company').min()    #alphabets sorted by min (descending order)

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [67]:
df.groupby('Company').describe()    #gives important information all at once

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Merging Joining and Concatenating dataframes

In [82]:
import pandas as pd

In [83]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [84]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [85]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [86]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [87]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [88]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Concatenation: Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use pd.concat and pass in a list of DataFrames to concatenate together:

In [90]:
pd.concat([df1,df2,df3])  #axis=0(by default) --> joins the rwos

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [91]:
pd.concat([df1,df2,df3],axis=1)  
#bunch of null values, so we need to make sure that when we are working with pd.concat that we have information lining up
#correctly when we join on the axis

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [92]:
#Example Data Frames

In [93]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

In [94]:
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [95]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [96]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [97]:
#Merge: The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together.
pd.merge(left,right,how='inner',on='key')   #merging on a key column

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [98]:
#A more complicated examples

In [99]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [100]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [101]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [103]:
pd.merge(left, right, on=['key1', 'key2'])   #default is inner join

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [104]:
#Joining: Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a 
#single result DataFrame.

In [109]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],      #both left and right have different indexes. We join them using join
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [110]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [111]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [112]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [113]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

# Operations

In [114]:
import numpy as np
import pandas as pd

In [116]:
df=pd.DataFrame({'col1':[1,2,3,4],
                'col2':[444,555,666,444],
                'col3':['abc','def','ghi','xyz']})

In [117]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [118]:
#finding unique values in a dataframe
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [119]:
#to get the number of unique values we use nunique function
df['col2'].nunique()

3

In [120]:
df['col2'].value_counts()   #returns how many times each unique value occurs in the column

444    2
555    1
666    1
Name: col2, dtype: int64

In [121]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [122]:
df[df['col1']>2]   #conditional selection

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [123]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [124]:
def times2(x):
    return x*2

In [125]:
df['col1'].sum()   
#so we know that above, we can grab a column and call a built in function off of it.

10

In [126]:
#what if we want to apply our own custom function times2 to the above cell. Pandas has the ability to do that
df['col1'].apply(times2)   #broadcast that function to each member of the column

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [127]:
df['col3']    #we can also apply builtin function such as length (below cell)

0    abc
1    def
2    ghi
3    xyz
Name: col3, dtype: object

In [128]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [129]:
#apply is more powerful with lambda function. This way we do not have to write a whole separate function. We only need to apply
#it once
df['col2'].apply(lambda x: x*2)   #used most commonly

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [130]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [131]:
df.drop('col1',axis=1)    #df.drop('col1',axis=1,inplace=True)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [132]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [133]:
df.columns    #returns the list of column names

Index(['col1', 'col2', 'col3'], dtype='object')

In [134]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [135]:
#now let's learn about sorting and ordering a dataframe
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [137]:
#say we want to sort col2
df.sort_values('col2')    #index stays attached to row. No info lost

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [139]:
df.isnull()     #find null values in a dataframe (returns boolean value)

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [140]:

data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [141]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [142]:
#pivot table: create a multi index out of above data frame
df.pivot_table(values='D',index=['A','B'],columns=['C'])    #multi index

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

In [1]:
#Pandas as a library has the ability to read data and write data to avoid variety of sources

In this lecture we will be concerned with 4 main data sources

1. CSV Files
2. Excel
3. HTML
4. SQL

We will need to install with pip or conda:
1. conda install sqlalchemy
2. conda install lxml
3. conda install html5lib
4. conda install BeautifulSoup4

In [2]:
import pandas as pd

In [3]:
pwd   #location of notebook. This is where excel and CSV files should be in

'C:\\Users\\hp\\AppData\\Roaming\\SPB_Data'

In [4]:
#how to open and read CSV Files
pd.read_csv('Book1.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
#to write to a dataframe
df=pd.read_csv('Book1.csv')

In [6]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
df.to_csv('My_output')      #saves csv file
pd.read_csv('My_output')
#we get a column named unnamed 0 and that was the old index

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [8]:
df.to_csv('My_output',index=False)   #won't save old index and will automatically assign range index to the dataframe
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
#reading and writing from excel files. Pandas can read and write from excel file, it can't import formulas, images or things
#like macros.Using that from read_excel method may cause pandas to crash.
pd.read_excel('Book2.xlsx',sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
#writing a dataframe to an excel output is also a very simple process using a to_csv method
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')   #we have saved it to an excel file

In [12]:
#working with html (we need to install the libraries for it)
data=pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [14]:
type(data)

list

In [16]:
data[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [17]:
#pandas reading table with sql
from sqlalchemy import create_engine
#allows us to create a very simple sql engine in memory

In [18]:
engine=create_engine('sqlite:///:memory:')
#created a very temporary, very small sqlite engine database that is running in memory

In [19]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [22]:
df.to_sql('my_table1',engine)  
#we are goung to write to that very temporary engine that we have in memory

In [24]:
sqldf=pd.read_sql('my_table1',engine)

In [25]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15